// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
/*
int Sum(int n)
{
    int sum = 0;
    while(n > 0)
    {
        sum = sum + n % 10;
        n = n/10;
    }
    return sum;
}

Console.Write("Введите число ");
int num = Convert.ToInt32(Console.ReadLine());

Console.WriteLine(Sum(num));
*/